cases/ansys_verification/VMFL046-R4/case/constant/turbulenceProperties
FoamFile { version 2.0; format ascii; class dictionary; object momentumTransport; }
simulationType  laminar;
