cases/ansys_verification/VMFL046-R4/case/0/U
FoamFile { version 2.0; format ascii; class volVectorField; object U; }
dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (100 0 0);
boundaryField
{
    inlet      { type pressureInletVelocity; value uniform (100 0 0); }
    outlet     { type inletOutlet; inletValue uniform (0 0 0); value uniform (100 0 0); }
    wall       { type noSlip; }
    centreline { type symmetryPlane; }
    frontAndBack { type empty; }
}
